fast.wstest/scripts/bench/post_files/echolist100.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="uri:WSTestWeb-TestService"><soapenv:Header/><soapenv:Body><EchoList><list><i>1</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>4</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s><Next><i>7</i><f>2.0</f><s>wstest</s></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></Next></list></EchoList></soapenv:Body></soapenv:Envelope>
