fast.wstest/scripts/bench/post_files/echostruct100.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><EchoStruct xmlns="uri:WSTestWeb-TestService"><array><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l><l><i>4</i><f>2.0</f><s>wstest</s></l><l><i>1</i><f>2.0</f><s>wstest</s></l></array></EchoStruct></soapenv:Body></soapenv:Envelope>
